# Time for some practice!

Time to put to practice what we have just covered. We need to start off by reading three csvs; naijaprop.csv, proppro.csv and trovit.csv. Save each of these dataframes as naijaprop, proppro and trovit respectively.

Print out the first 5 rows of each dataframe and descriptive information regarding the columns in each dataframe

In [53]:
#answer here

## Question 1

Create a new column for each dataframe, name this column <strong><i>source</i></strong> and label the values in the column based on the source of the listing. For example, all the listings in castles should be labeled as castles in the column we named <strong><i>source</i></strong>

In [31]:
#answer here

## Question 2

Now, concatenate all the dataframes you have just read into one dataframe. This would be the equivalent of an outer merge, you should have a dataframe with <strong>18357 rows</strong> and <strong>6 columns</strong>, assign this to a variable named merged_df.

In [32]:
#answer here

## Question 3

We are going to do a bit of data cleaning, we need to remove the Naira sign from all the prices in our price column. This is a good add that for every issue you may encounter when writing code there is a good probability that someone has experienced something similar. If you do not know how to remove non numerical characters from a column, try Google this query with the phrase <strong><i>site:stackoverflow.com</i></strong> added to the end of your query and read a few answers with people trying different solutions and customize one of those for this question.

In [59]:
#answer here

## Question 4 

Find the missing and NaN values in the bedrooms and baths columns, how do you want to treat these missing values, there is no right or wrong answer. Find the most appropriate solution and explain your logic, ie why did you choose that particular method, what impact might it have on the accuracy and integrity of our data?

In [62]:
#answer here

## Question 5

You will notice that some listings do not have a state, instead the state is included in the location. Select all rows in the dataset where the value in the location columns contains the word <strong><i>State</i></strong> and where the state column contains an NaN value

In [69]:
#answer here

## Question 6 

Ok, we are going to think of a way to clean up our data. Where we have an NaN value in the state column we are going to extract the state from the location column and append the value to the state column.
We are going to try and find a simple solution for this.

Let's start off by listing all unique states values in our merged_df dataframe

In [76]:
#answer here

## Question 7

We are going to make the assumption that the list we just created is a list of all the states detailed in our list. Remember only about a third of listings have no state, we can assume that the remainder of the 2/3rd would probably have listings from all the states covered in our merged_df dataframe. Let's check how accurate our assumption is.

You need to find all rows under the column <strong><i>'location'</i></strong> containing the strings in the list we created in Question 6 and replace the NaN value in state with the name of the state that the row contains

For example if a row has the value <strong>Lagos State</strong> rename the state column with the value <strong>Lagos</strong>

Here is a tip, convert all the strings in location column to lower case and then search for strings that contain the values you found in Question 6 (convert these to lower case too)

In [109]:
#answer here

## Question 8

Let' check how many NaN values we have under the state column now

In [97]:
#answer here

## Question 9

Ok, so we still have NaN values, print out all the unique values in the <strong><i>location</i></strong> column for rows that still have an NaN values under the <strong><i>state</i></strong> column. You will notice that there actually aren't too many unique states. There are however, a lot of unique locations. Let's try and rename the states column based on the unique states we identify. Keep checking whether or not you have filled all NaN values under state.

<i>Please document your solution, explain what you did and why</i>

In [111]:
#answer here

## Question 10 

Which state has the most expensive listing?

<i>Show the code you used to find this listing</i>

In [112]:
#answer here

## Question 11

Which state has the least expensive listing?

<i>Show the code you used to find this listing</i>

In [115]:
#answer here

## Question 12

Save <strong>merged_df</strong> as a csv file in your computer, use whatever name you will feel comfortable with

In [117]:
#answer here

In [118]:
merged_df

,price,unit,location,bedrooms,baths,state
0,1000000,per Year,"15 - 17 bolaji balogun street, ayonusi estate,...",5,6,Ogun
1,600000,per Year,"15 - 17 bolaji balogun street, ayonusi estate,...",3,3,Lagos
2,250000,per Year,"badore,owode and addo roads,",1,1,Lagos
3,1000000,per Year,"ilupeju,",3,2,Lagos
4,600000,per Year,"badore road,",NaN,NaN,Lagos
...,...,...,...,...,...,...
6692,80000,per Year,"ikorodu, lagos state",1,1,Lagos
6693,1500000,per Year,"ajah, eti osa, lagos state",4,4,Lagos
6694,1500000,per Year,"lekki, ibeju lekki, lagos state",3,3,Lagos
6695,1200000,per Year,"lekki, ibeju lekki, lagos state",2,2,Lagos
6696,80000,per Year,"ikorodu, lagos state",1,1,Lagos